УНФ_ТЕСТ/src/Catalogs/НастройкиНумерацииДоговоровКонтрагентов/НастройкиНумерацииДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиНумерацииДоговоровКонтрагентов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматНомера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримерНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяНумерация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоговора</name>
    <type>
      <types>CatalogRef.КатегорииДоговоров</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/НастройкиНумерацииДоговоровКонтрагентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		// Проверяем, есть ли уже аналогичные настройки
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиНумерацииДоговоровКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиНумерацииДоговоровКонтрагентов КАК НастройкиНумерацииДоговоровКонтрагентов
		|ГДЕ
		|	НЕ НастройкиНумерацииДоговоровКонтрагентов.Ссылка = &Ссылка
		|	И НастройкиНумерацииДоговоровКонтрагентов.Организация = &Организация
		|	И НастройкиНумерацииДоговоровКонтрагентов.ВидДоговора = &ВидДоговора
		|	И НастройкиНумерацииДоговоровКонтрагентов.КатегорияДоговора = &КатегорияДоговора
		|	И НастройкиНумерацииДоговоровКонтрагентов.Договор = &Договор";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ВидДоговора",  ВидДоговора);
		Запрос.УстановитьПараметр("КатегорияДоговора", КатегорияДоговора);
		Запрос.УстановитьПараметр("Договор",  Договор);
		Запрос.УстановитьПараметр("Ссылка",  Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекстСообщения = НСтр(
				"ru = 'В базе присутствует аналогичная настройка нумерации договоров. Создание одинаковых настроек запрещено.'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
